/*
 * 来源：C++题库 题号682
 * 章节：第6章-数组与字符串
 * 难度：易
 * 题序：第22题
 *
 * 题目：写一个函数，计算x的n次方
 */

第22题 （0.1分）        题号:682        难度:易        第6章
/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：写一个函数，计算x的n次方。
函数原型是long myfun(int x,int n)

------------------------------------------------------------------------------*/
#include <iostream>
#include <fstream>
using namespace std;
void wwff();

long myfun(int x,int n)
{
/**********Program**********/






/**********  End  **********/
}

int main()
{

  cout<<myfun(12,2)<<endl;
//忽略阅读
  wwff();
//忽略阅读结束
  return 0;
}
//忽略阅读
void wwff()
{
  ifstream rf("in.txt",ios::in);
   int n,x;
   rf>>x>>n;   
   ofstream wf("out.txt",ios::out);   
   wf<<myfun(x,n);
   rf.close();
   wf.close();
}   
 


/* ───────── 参考答案 ─────────
int x1=1;
  while(n>0)
  {
	  x1=x1*x;
      n--;
  }
  return x1;
   ─────────────────────────── */
