/*
 * 来源：C++题库 题号716
 * 章节：第6章-数组与字符串
 * 难度：较难
 * 题序：第31题
 *
 * 题目：函数char *conv(unsigned int n, char *s);将十
 */

第31题 （0.1分）        题号:716        难度:较难        第6章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：函数char *conv(unsigned int n, char *s);将十
      进制整数n转换成8进制的字符串存入字符数组s中
      并返回，例如n为12时，s中的字符串是”014”
     （必须以0开始），完成该函数的编写。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include <iostream.h>
char *conv(unsigned int n , char *s)
{
/**********Program**********/




/**********  End  **********/

return s;
}

void main()
{
   int i;
   cout<<"请输入一个无符号整数"<<endl;
   cin>>i;
   char ch[20];
   char * pChar;
   pChar=ch;
   pChar=conv(i,ch);
   cout<<ch<<endl;
}


/* ───────── 参考答案 ─────────
int i=0;
      char array[20];
      while(n>0)
     {
        array[i]=n%8+'0';
        i=i+1;
        n=n/8;
      }
      array[i]='0';
      i++;
      for(int j=i-1;j>=0;j--)
        *(s+j)=array[i-1-j];
      *(s+i)='\0';
   ─────────────────────────── */
