/*
 * 来源：C++题库 题号736
 * 章节：第6章-数组与字符串
 * 难度：较难
 * 题序：第38题
 *
 * 题目：完成函数codec的编写，该函数判断一个整数是否是
 */

第38题 （0.1分）        题号:736        难度:较难        第6章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：完成函数codec的编写，该函数判断一个整数是否是
      一个正确的密码，若是则返回1，不是则返回0。
      密码规则是：整数必须是6位正整数，从左到右分别
      为第1位到第6位，其中第i位数字是第i-1位数字加1
      后的3次方的个位数（2<=i<=6）。
      比如：密码272727中第2位的'7'是第1位的'2'加1后
      的3次方的个位数（(2+1)的3次方为27，其个位数为7），
      第3位的'2'是第2位的'7'加1后的3次方的个位数
      （(7+1)的3次方为512，其个位数为2），以此类推。

--------------------------------------------------
注意：仅在标有"Program"和"End"的注释行之间补充填
      写代码。请勿改动主函数main和其它任何已有内
      容。
------------------------------------------------*/

#include <iostream.h>
#include <fstream.h>
void grading();

//判断6位密码是否正确，若正确返回1；不正确返回0。
int codec(int code)
{
/**********Program**********/


/**********  End  **********/
}
int main()
{
        int isCorrect = 0;
        int cd = 272727;
        isCorrect = codec(cd);
        if (isCorrect==1)
                cout << "密码正确!" << endl;
        else
                cout << "密码不正确!" << endl;

//忽略阅读
        grading();
//忽略阅读结束
        return 0;
}
//以下忽略阅读
void grading()
{
        int cd;
        int k;
        fstream infile, outfile;
        infile.open("in.txt", ios::in);
        outfile.open("out.txt",ios::out);
        for(k=0;k<10;k++){
                infile >> cd;
                outfile << codec(cd)<< endl;
        }
        infile.close();
        outfile.close();
}



/* ───────── 参考答案 ─────────
if (code>999999 || code<100000)
		return 0;
	int a[6] = {0},i;
	for (i=0;i<6;i++)
	{
		a[5-i] = code%10;
		code = code/10;
	}
	for (i=1; i<6; i++)
		if (a[i]!=((a[i-1]+1)*(a[i-1]+1)*(a[i-1]+1))%10)
			return 0;
	return 1;
   ─────────────────────────── */
