/*
 * 来源：C++题库 题号771
 * 章节：第6章-数组与字符串
 * 难度：中
 * 题序：第73题
 *
 * 题目：某学生的记录有学号、8 门课程成绩和平均分组成，学
 */

第73题 （0.1分）        题号:771        难度:中        第6章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：某学生的记录有学号、8 门课程成绩和平均分组成，学
      号和8 门课程的成绩已在主函数中给出。请编写函数fun，
      它的功能是：求出该学生的平均分放在记录的ave 成员中。
例如：学生的成绩是：85.5，76，69.5，85，91，72，64.5，
      87.5，他的平均分应当是：78.875。

注意：部分源程序存在文件PROG1.C 中。
--------------------------------------------------
注意：仅在标有"Program"和"End"的注释行之间补充填
      写代码。请勿改动主函数main和其它任何已有内
      容。
-------------------------------------------------------*/

#include <stdio.h>
void NONO ();
#define N 8

typedef struct
{ 
        char num[10];
        double s[N];
        double ave;
} STREC;

void fun(STREC *a)
{

/**********Program**********/





/**********  End  **********/

}
main()
{ 
        STREC s={"GA005",85.5,76,69.5,85,91,72,64.5, 87.5};
        int i;
        fun(&s);
        printf("The %s's student data:\n", s.num);
        for(i=0;i<N; i++)
                printf("%4.1f\n",s.s[i]);
        printf("\nave=%7.3f\n",s.ave);
        NONO();
}

void NONO ()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *out ;
        int i,j ; STREC s[10] = {
                {"GA005",85.5,76,69.5,85,91,72,64.5,87.5},
                {"GA001",82.5,66,76.5,76,89,76,46.5,78.5},
                {"GA002",72.5,56,66.5,66,79,68,46.5,58.5},
                {"GA003",92.5,76,86.5,86,99,86,56.5,88.5},
                {"GA004",82,66.5,46.5,56,76,75,76.5,63.5},
                {"GA006",75.5,74,71.5,85,81,79,64.5,71.5},
                {"GA007",92.5,61,72.5,84,79,75,66.5,72.5},
                {"GA008",43.5,56,98.5,86,84,67,76.5,83.5},
                {"GA009",66.5,71,74.5,70,61,82,86.5,58.5},
                {"GA010",76,66.5,75.5,60,76,71,96.5,93.5}
        };

        out = fopen("out.dat","w");
        for(i = 0 ; i < 10 ; i++) {
                fun(&s[i]);
                fprintf(out,"%7.3f\n",s[i].ave);
        }
        fclose(out);
}


/* ───────── 参考答案 ─────────
int i;
	for(i=0; i<N; i++)
		a->ave=a->ave+a->s[i];
	a->ave /=N;
   ─────────────────────────── */
