/*
 * 来源：C++题库 题号772
 * 章节：第6章-数组与字符串
 * 难度：中
 * 题序：第74题
 *
 * 题目：程序定义了N×N 的二维数组，并在主函数中赋值
 */

第74题 （0.1分）        题号:772        难度:中        第6章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：程序定义了N×N 的二维数组，并在主函数中赋值。请
      编写函数fun，函数的功能是：求出数组周边元素的平均值
      并作为函数值返给主函数中的s。其中周边元素包括：
      第一行的元素、第n 行的元素、第一列的元素、第n 列的元素。
例如：一个 5×5 的数组 a 中的值为：
                0 1 2 7 9
                1 9 7 4 5
                2 3 8 3 1
                4 5 6 8 2
                5 9 1 4 1
      则返回主程序后s 的值应为：3.375。

注意：部分源程序存在文件PROG1.C 中。
--------------------------------------------------
注意：仅在标有"Program"和"End"的注释行之间补充填
      写代码。请勿改动主函数main和其它任何已有内
      容。
-------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
void NONO ();

#define N 5
double fun (int w[][N])
{

/**********Program**********/






/**********  End  **********/

}
main()
{ 
        int a[N][N]={0,1,2,7,9,1,9,7,4,5,2,3,8,3,1,4,5,6,8,2,5, 9,1,4,1};
        int i, j;void NONO ();
        double s ;
        printf("***** The array *****\n");
        for (i =0; i<N; i++)
        { 
                for (j =0; j<N; j++){printf("%4d", a[i][j]);}
                printf("\n");
        }
        s = fun (a);
        printf ("***** THE RESULT *****\n");
        printf("The sum is : %lf\n",s);
        NONO();
}

void NONO ()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *rf, *wf ;
        int i, j, k, a[5][5]; double s ;
        rf = fopen("in.dat","r");
        wf = fopen("out.dat","w");
        for(k = 0 ; k < 10 ; k++){
                for(i = 0 ; i < 5 ; i++)
                        for(j = 0 ; j < 5 ; j++) fscanf(rf, "%d ", &a[i][j]);
                s = fun(a);
                fprintf(wf, "%.3lf\n", s);
        }
        fclose(rf);
        fclose(wf);
}


/* ───────── 参考答案 ─────────
int i, j, n=0;
	double sum=0;
	for ( i=0; i<N; i++){
		sum+=w[0][i]+w[N-1][i]; n+=2;
	}
	for ( i=1; i<N-1; i++){
		sum+=w[i][0]+w[i][N-1];
		n+=2;
	}
	return sum/n;
   ─────────────────────────── */
