/*
 * 来源：C++题库 题号775
 * 章节：第6章-数组与字符串
 * 难度：中
 * 题序：第77题
 *
 * 题目：函数 fun 的功能是：计算
 */

第77题 （0.1分）        题号:775        难度:中        第6章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：函数 fun 的功能是：计算
      f(x) = 1 + x + x*x/2! + x*x*x/3! + x*x*...*x/n!
      的前 n+1 项。若 x=2.5，函数值为：12.182465。
      其中，第 n+1 项是 x 的 n 次幂除以 n 的阶乘。

      请在程序的下划线处填入正确的内容并把下划线删除，
      使程序得出正确的结果。

注意：源程序存放在考生文件夹下的BLANK1.C中。
      不得增行或删行，也不得更改程序的结构。
-------------------------------------------------------*/

#include <stdio.h>
void NONO();

/**********Program**********/
double fun(double x, int n)
{ 
        double f, t; int i;
        f = 1.0;
/**********found**********/
        t = ___1___;
/**********found**********/
        for (___2___)
        {
/**********found**********/
                t *= ___3___;
                f += t;
        }
        return f;
/**********End**********/
}

main()
{       double x, y;
        x=2.5;
        y = fun(x, 12);
        printf("\nThe result is :\n");
        printf("x=%-12.6f y=%-12.6f\n", x, y);
        NONO();
}

void NONO()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out;
        double x, y;
        int n, i;
        in = fopen("in.dat","r");
        out = fopen("out.dat","w");
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%lf %d", &x, &n);
                y = fun(x,n);
                fprintf(out, "x=%-12.6f y=%-12.6f\n", x, y);
                printf("%f %d %f\n", x, n, y);
        }
        fclose(in);
        fclose(out);
}



/* ───────── 参考答案 ─────────
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：函数 fun 的功能是：计算
      f(x) = 1 + x + x*x/2! + x*x*x/3! + x*x*...*x/n!
      的前 n 项。若 x=2.5，函数值为：12.182340。
	  其中，第 n 项是 x 的 n 次幂除以 n 的阶乘。

      请在程序的下划线处填入正确的内容并把下划线删除，
	  使程序得出正确的结果。

注意：源程序存放在考生文件夹下的BLANK1.C中。
      不得增行或删行，也不得更改程序的结构。

--------------------------------------------------
注意：仅在标有"Program"和"End"的注释行之间补充填
      写代码。请勿改动主函数main和其它任何已有内
      容。
-------------------------------------------------------*/

#include <stdio.h>
void NONO();

double fun(double x, int n)
{ 
	double f, t; int i;
	f = 1.0;
/**********found**********/
	t = 1;
/**********found**********/
	for (i=1; i<=n; i++)
	{
/**********found**********/
		t *= x/i;
		f += t;
	}
	return f;
}

main()
{	double x, y;
	x=2.5;
	y = fun(x, 12);
	printf("\nThe result is :\n");
	printf("x=%-12.6f y=%-12.6f\n", x, y);
	NONO();
}

void NONO()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
	FILE *in, *out;
	double x, y;
	int n, i;
	in = fopen("in.dat","r");
	out = fopen("out.dat","w");
	for(i = 0 ; i < 10 ; i++)
	{
		fscanf(in, "%lf %d", &x, &n);
		y = fun(x,n);
		fprintf(out, "x=%-12.6f y=%-12.6f\n", x, y);
		printf("%f %d %f\n", x, n, y);
	}
	fclose(in);
	fclose(out);
}
   ─────────────────────────── */
