/*
 * 来源：C++题库 题号801
 * 章节：第6章-数组与字符串
 * 难度：中
 * 题序：第85题
 *
 * 题目：在一笼子里，鸡和兔的个数共m只，脚有n只，编写
 */

第85题 （0.1分）        题号:801        难度:中        第6章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：在一笼子里，鸡和兔的个数共m只，脚有n只，编写
      函数myChicken来计算鸡和兔各多少只？计算结果
      存放在参数c（鸡的只数）和r（兔的只数）中。要
      求对程序输入和程序输出作合法性检查，约定输出
      不合法时的值为-1和-1。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<iostream>
#include <fstream>
using namespace std;

// m: 鸡和兔的总个数；n: 脚的总只数；
// c: 存放计算出的鸡的只数；r: 存放计算出的兔的只数。
int myChicken(int m, int n, int * c, int * r);
int grading();

int main()
{
        int c, r;  // c: 存放计算出的鸡的只数；r: 存放计算出的兔的只数
        
        myChicken(100, 300, &c, &r); 
        cout << "共有" << c << "只鸡" << endl;
        cout << "共有" << r << "只兔" << endl;

//忽略阅读
        grading();
//忽略阅读结束

        return 0;
}

int myChicken(int m, int n, int * c, int * r)
{
        /*************** Program *****************/
        




        
        /*************** End *****************/
        
        return 0;
}

//以下忽略阅读
int grading()
{        
        fstream myF,myfile;
        int m,n,i;
        int c, r;
        myfile.open("in.txt",ios::in);
        myF.open("out.txt",ios::out);
        for(i=0;i<10;i++)
       {
        myfile>>m>>n;
        myChicken(m,n, &c, &r);
        myF << c <<' '<< r;
        myF<<endl;
       }
        myF.close();
        myfile.close();
        return 0;
}



/* ───────── 参考答案 ─────────
if(m<0||n<0||(n-2*m)%2!=0||n%2!=0)
		 {
			 *c=-1;
			 *r=-1;
		 }
         else
		 {
			 *c=2*m-n/2;
			 *r=(n-2*m)/2;

		 }
         if(*c<0||*r<0)
		 {
                         *c=-1;
			 *r=-1;
		 }
   ─────────────────────────── */
