/*
 * 来源：C++题库 题号528
 * 章节：第4章-数组与综合设计
 * 难度：中
 * 题序：第46题
 *
 * 题目：用递归函数P(n,x)实现勒让德多项式(参考图1).
 */

第46题 （0.1分）        题号:528        难度:中        第4章
/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：用递归函数P(n,x)实现勒让德多项式(参考图1).
        
--------------------------------------------------------------------------------
注意：
1.部分源程序给出如下。请勿改动主函数main和其它函数中的任何内容，仅在*program*
  和*end*所标记的区域内完成题干要求的函数功能。
2.//忽略阅读与//忽略阅读结束内的程序可以忽略阅读。
------------------------------------------------------------------------------*/
#include<iostream>
#include<fstream>
using namespace std;

/*********Program*********/




/*********  End  *********/


//忽略阅读
int main ()
{
        int m;
        double n;
        fstream infile, outfile;
        infile.open ("in.dat",ios::in);
        outfile.open("out.dat",ios::out);
        
        for (int i=0;i<2;i++)
        {
                infile>>m;
                infile>>n;
                outfile<<P(m,n)<<endl;
        }

        infile.close();
        outfile.close();
       
      return 0;
}
//忽略阅读结束



/* ───────── 参考答案 ─────────
double P(int n,double x)
{
	if(n==0) return 1;
	if(n==1) return x;
	return ((2*n-1)*x*P(n-1,x)-(n-1)*P(n-2,x))/n;
}
   ─────────────────────────── */
