/*
 * 来源：C++题库 题号628
 * 章节：第4章-数组与综合设计
 * 难度：较易
 * 题序：第96题
 *
 * 题目：求最大数
 */

第96题 （0.1分）        题号:628        难度:较易        第4章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：求最大数
问555555的约数中最大的三位数是多少？

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。

-------------------------------------------------------*/
#include <iostream>
#include <fstream>
using namespace std;

void output(int i);

int main()
{
        int i;
        static int n=555555;
/**********Program**********/




/**********  End  **********/        
        cout<<"555555的约数中最大的三位数是"<<i<<endl;
        output(i);
        return 0;
}

void output(int i)
{
        ofstream myfile;
        myfile.open("f2.txt",ios::out);
        myfile<<i<<endl;
        myfile.close();
}



/* ───────── 参考答案 ─────────
----------------------
	for(i=999;i>=100;i--)
		if(n%i==0)
		{
			break;
		}
----------------------
   ─────────────────────────── */
