/*
 * 来源：C++题库 题号629
 * 章节：第4章-数组与综合设计
 * 难度：较难
 * 题序：第97题
 *
 * 题目：阶乘尾数零的个数
 */

第97题 （0.1分）        题号:629        难度:较难        第4章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：阶乘尾数零的个数
100!的尾数有多少个零？ 

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。

-------------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

void output(int i);

int main()
{
        int i,count =0;

/**********Program**********/




/**********  End  **********/     
        cout<<"100!的尾数有"<<count<<"个零。"<<endl;
        output(count);
        return 0; 
}

void output(int i)
{
        ofstream myfile;
        myfile.open("f2.txt",ios::out);
        myfile<<i<<endl;
        myfile.close();
}



/* ───────── 参考答案 ─────────
----------------------
	for(i=5;i<=100;i+=5) 
	{
		++count; 
		if(!(i%25)) ++count; 
	}

----------------------
   ─────────────────────────── */
