/*
 * 来源：C++题库 题号630
 * 章节：第4章-数组与综合设计
 * 难度：较难
 * 题序：第98题
 *
 * 题目：编写函数borrow，实现下述功能：小明有五本新书，要借
 */

第98题 （0.1分）        题号:630        难度:较难        第4章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数borrow，实现下述功能：小明有五本新书，要借
      给A，B，C三位小朋友，若每人每次只能借一本，则可以有
      多少种不同的借法？要求将计算出的结果返回。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
-------------------------------------------------------*/
#include <iostream>
#include <fstream>
using namespace std;

void output(int i);

int borrow()
{
/**********Program**********/



/**********  End  **********/     
}

int main()
{
        int count;
        
        count=borrow();
        cout<<"共有"<<count<<"种不同的借书方案！"<<endl;
        output(count);
        return 0;
}

void output(int i)
{
        ofstream myfile;
        myfile.open("f2.txt",ios::out);
        myfile<<i<<endl;
        myfile.close();
}



/* ───────── 参考答案 ─────────
----------------------
int a,b,c,count=0;
	for(a=1;a<=5;a++) 
		for(b=1;b<=5;b++) 
			for(c=1;a!=b&&c<=5;c++) 
				if(c!=a&&c!=b) count++;
	return count;
----------------------
   ─────────────────────────── */
