/*
 * 来源：C++题库 题号634
 * 章节：第4章-数组与综合设计
 * 难度：中
 * 题序：第100题
 *
 * 题目：3025这个数具有一种独特的性质：将它平分为二段，即30
 */

第100题 （0.1分）        题号:634        难度:中        第4章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：3025这个数具有一种独特的性质：将它平分为二段，即30
      和25，使之相加后求平方，即(30+25)*(30+25)，恰好等于
      3025本身。
要求：完成函数valid，该函数判断n是否是满足abcd=(ab+cd)*
      (ab+cd)这样性质的四位数，是则返回true，否则返回
      false。
  
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
---------------------------------------------------------*/
#include <iostream>
#include <fstream>
using namespace std;
int grading();

bool valid(int n)
{        
        /**********Program**********/

        
        
        /**********Program**********/
}

int main()
{
        int num;
        cout<<"input a num:";
        cin>>num;
        if (valid(num))
                cout<<num<<"满足性质"<<endl;
        else
                cout<<num<<"不满足性质"<<endl;

//忽略阅读
        grading();
//忽略阅读结束

        return 0;
}

//以下忽略阅读
int grading()
{
        int n;
        ofstream outfile;
        outfile.open("out.txt");
        for(n=1000;n<10000;n++) 
        {
                if (valid(n))
                        outfile<<n<<endl;
        }
        outfile.close();
        return 0;
}




/* ───────── 参考答案 ─────────
int a,b;
	a=n/100; 
	b=n%100; 
	if((a+b)*(a+b)==n) 
		return true;
	return false;
   ─────────────────────────── */
