/*
 * 来源：C++题库 题号639
 * 章节：第4章-数组与综合设计
 * 难度：中
 * 题序：第105题
 *
 * 题目：编写程序，求一个 3 ╳ 5阶矩阵 a 与其自身转置矩阵 c 的乘积，
 */

第105题 （0.1分）        题号:639        难度:中        第4章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，求一个 3 ╳ 5阶矩阵 a 与其自身转置矩阵 c 的乘积，
结果存入数组 b 中。

-------------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。

-------------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;


int main()
{
        int a[3][5];
        int c[5][3];

        ifstream infile("in.txt",ios::in);

        int i, j;
        for(i=0;i<3;i++)
          for(j=0;j<5;j++)
             infile>>a[i][j];
         
        infile.close();

        int b[3][3]={{0}};

/**********Program**********/






/**********  End  **********/

        fstream outfile("out.txt",ios::out);
        for(i=0;i<3;i++)
             for(j=0;j<3;j++)
              {
                  outfile<<b[i][j]<<" ";
                  outfile<<endl;
              }
        outfile.close();    
        return 0;

}




/* ───────── 参考答案 ─────────
for(i=0;i<3;i++)
		for(j=0;j<5;j++)
		    c[j][i]=a[i][j];
		
	for(i=0;i<3;i++)
		for(j=0;j<3;j++)
		{
			for(int k=0;k<5;k++)
			   b[i][j]+=a[i][k]*c[k][j];
		}
   ─────────────────────────── */
