/*
 * 来源：C++题库 题号648
 * 章节：第4章-数组与综合设计
 * 难度：中
 * 题序：第114题
 *
 * 题目：下面程序中的函数函数int mylist(int n);计算
 */

第114题 （0.1分）        题号:648        难度:中        第4章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：下面程序中的函数函数int mylist(int n);计算
数列中的第n个数并返回，数列的定义如下：0,  1,  2,  
5,  12…即，第0个数为0，第1个数为1，第n（n>1）个数
为第n-2个数加上2倍的第n-1个数。完成该函数。
        
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream>
#include<iostream>
using namespace std;
int mylist(int n);

int main()
{
        int i;
        fstream outfile;
        outfile.open("out.txt",ios::out);
        for (i=1;i<=25;i++)
        {
                outfile<<mylist(i)<<endl;
        }
        outfile.close();
        return 0;
}


int mylist(int n)
{
/**********Program**********/
        
/**********  End  **********/
}


/* ───────── 参考答案 ─────────
if (n<2)
		return n;
	int a=0,b=1,c,i;
	for (i=0;i<n-1;i++)
	{
		c=a+b+b;
		a=b;
		b=c;
	}
	return c;
   ─────────────────────────── */
