/*
 * 来源：C++题库 题号652
 * 章节：第4章-数组与综合设计
 * 难度：较难
 * 题序：第118题
 *
 * 题目：某个公司采用公用电话传递数据，数据是四位的整
 */

第118题 （0.1分）        题号:652        难度:较难        第4章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

  题目：某个公司采用公用电话传递数据，数据是四位的整
        数，在传递过程中是加密的。加密规则如下：每位
        数字都加上5，然后用和除以10的余数代替该数字，
        再将第一位和第四位交换，第二位和第三位交换 。 
        写一个函数实现这个算法，函数原型是
        int changeinfo(int info)
  
--------------------------------------------------
        
      注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在注释形式标识Program和
      End之间填入所编写的若干语句。
          
---------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
void grading();

/**********Program**********/









/**********  End  **********/
int main()
{
        cout<<"原数为2348，加密后为："<<changeinfo(2348)<<endl;
        
        //忽略阅读
        grading();
        //忽略阅读结束
        return 0;
}

//忽略阅读
void grading()
{
        int i;
        ifstream rf("in.txt",ios::in);
        ofstream wf("out.txt",ios::out);   
        int info;
        for (i=0;i<8;i++)
        {
                rf>>info;   
                wf<<changeinfo(info)<<endl;
        }
        rf.close();
        wf.close();
}   
//忽略阅读结束


/* ───────── 参考答案 ─────────
int changeinfo(int info)
{
	int a[4];
	a[0]=info%10;
	a[1]=info%100/10;
	a[2]=info%1000/100;
	a[3]=info/1000;
	for(int i=0;i<=3;i++)
	{ a[i]+=5;a[i]%=10;}
	for( i=0;i<=3/2;i++)
	{
		int t=a[i];
        a[i]=a[3-i];
        a[3-i]=t;
	}
	return a[0]+a[1]*10+a[2]*100+a[3]*1000;
}
   ─────────────────────────── */
