/*
 * 来源：C++题库 题号679
 * 章节：第4章-数组与综合设计
 * 难度：中
 * 题序：第139题
 *
 * 题目：某个公司采用公用电话传递数据，
 */

第139题 （0.1分）        题号:679        难度:中        第4章
/*------------------------------------------------------------------------------
【程序设计】637 中 4
--------------------------------------------------------------------------------

题目：某个公司采用公用电话传递数据，
数据是四位的整数，在传递过程中是加密的，
加密规则如下：每位数字都加上5，
然后用和除以10的余数代替该数字，
再将第一位和第四位交换，
第二位和第三位交换 。 
写一个函数实现这个算法，
函数原型是 int changeinfo(int info)

------------------------------------------------------------------------------*/


#include <iostream>
#include <fstream>
using namespace std;
void wwff();
/**********Program**********/






/**********  End  **********/
int main()
{
  cout<<changeinfo(2348);
//忽略阅读
  wwff();
//忽略阅读结束
  return 0;
}
//忽略阅读
void wwff()
{
   ifstream rf("in.txt",ios::in);
   int info;
   rf>>info;   
   ofstream wf("out.txt",ios::out);   
  
   wf<<changeinfo(info);
   rf.close();
   wf.close();
}   
//忽略阅读结束


/* ───────── 参考答案 ─────────
int changeinfo(int info)
{
 int a[4];
  a[0]=info%10;
  a[1]=info%100/10;
  a[2]=info%1000/100;
a[3]=info/1000;
  for(int i=0;i<=3;i++)
   { a[i]+=5;a[i]%=10;}
  for( i=0;i<=3/2;i++)
	{
       int t=a[i];
        a[i]=a[3-i];
        a[3-i]=t;
}
return a[0]+a[1]*10+a[2]*100+a[3]*1000;
}
   ─────────────────────────── */
