/*
 * 来源：C++题库 题号511
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第33题
 *
 * 题目：将100元换成用若干10元、5元和1元的组合，共有多少种组合方法
 */

第33题 （0.1分）        题号:511        难度:中        第2章
/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：将100元换成用若干10元、5元和1元的组合，共有多少种组合方法。

------------------------------------------------------------------------------*/
#include<iostream.h>
#include<fstream.h>
void writeinfile(int);
int main(){


/*********Program*********/




/*********  End  *********/
        writeinfile(n);
        return 0;
}

void writeinfile(int n)
{
        fstream myfile;
        myfile.open("f.txt",ios::out);
        myfile<<n<<endl;
        myfile.close();
}




/* ───────── 参考答案 ─────────
int i,j,k,count=0;
	for(i=0;i<=10;i++)//i是10元张数，j是5元张数，k是1元张数
		for(j=0;j<=20;j++){
			k=100-10*i-5*j;
			if(k>=0){
				//cout<<i<<'\t'<<j<<'\t'<<k<<endl;
				count++;
			}
		}
	cout<<count<<endl;
	return 0;
   ─────────────────────────── */
