/*
 * 来源：C++题库 题号577
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第56题
 *
 * 题目：求多项式 1！+2！+3！+……+10!的值存入变量 out 中.
 */

第56题 （0.1分）        题号:577        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：  求多项式 1！+2！+3！+……+10!的值存入变量 out 中.

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream.h>
#include<iostream.h>

void wwjt(int o);

int main()
{
     int n=1,s=0;
     int out=0;

/**********Program**********/





        
/**********  End  **********/
           wwjt(out);
        return 0;
}
void wwjt(int o)
{
        fstream myfile;
        myfile.open("out.dat",ios::out);
        myfile<<o<<endl;
        myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
     for (int i=1; i<=10; i++)
       {
              n = n*i;
              s += n;
       }
       cout <<s<<endl;
	   out = s ;
----------------------
   ─────────────────────────── */
