/*
 * 来源：C++题库 题号580
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第59题
 *
 * 题目：在一维数组中分类统计正数和负数的个数
 */

第59题 （0.1分）        题号:580        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：在一维数组中分类统计正数和负数的个数。
      正数的个数存入变量C1中,负数个数存入变量C2中.

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream>
#include<iostream>
using namespace std;
void wwjt(int ,int );

void main()
{
       int a[10]={1,-2,0,4,-5,0,7,8,-9,10};
       int c1=0,c2=0;
       int i;
/**********Program**********/





/**********  End  **********/
        wwjt(c1,c2);
}

void wwjt(int o,int p)
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile<<o<<endl<<p;
        myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
       for (i=0; i<10; i++)
              if (a[i]>0) 
                     c1++;
              else if (a[i]<0)
                     c2++;
----------------------
   ─────────────────────────── */
