/*
 * 来源：C++题库 题号582
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第61题
 *
 * 题目：在包含10个数的一维整数数组a中查找最大元素max
 */

第61题 （0.1分）        题号:582        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：在包含10个数的一维整数数组a中查找最大元素max
      和最小元素min。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream>
#include<iostream>
using namespace std;

void main()
{
       int a[10] = {32,43,65,23,432,543,543,54,542,87};
       int i; 
       int max,min;      
/**********Program**********/




/**********  End  **********/

       cout <<"最大元素："<<max<<endl
            <<"最小元素："<<min<<endl;
           void wwjt(int,int);
           wwjt(max, min);
}
void wwjt(int o,int p)
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile<<o<<endl<<p;
        myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
       max=a[0];
       min=a[0];
       for (i=1; i<10; i++){
              if (a[i]>max) max=a[i];
              if (a[i]<min) min=a[i];
       }
----------------------
   ─────────────────────────── */
