/*
 * 来源：C++题库 题号583
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第62题
 *
 * 题目：用while循环编程，求自然数1至100之间各奇数平方
 */

第62题 （0.1分）        题号:583        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：用while循环编程，求自然数1至100之间各奇数平方
      和 sum 。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream.h>
#include<iostream.h>
void main()
{
int i=1,sum=0;
/**********Program**********/




/**********  End  **********/
        void wwjt(int);
        wwjt(sum);
}

void wwjt(int o)
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile<<o<<endl;
        myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
	while(i<=100)
	{sum+=i*i;i+=2;}
	cout<<"sum="<<sum<<endl;
----------------------
   ─────────────────────────── */
