/*
 * 来源：C++题库 题号588
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第67题
 *
 * 题目：求1-1000之间同构数的个数n
 */

第67题 （0.1分）        题号:588        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 求1-1000之间同构数的个数n。同构数是：
       "某数与其自身的平方数的后几位相同"。
       例如：25×25＝625，25是同构数。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream.h>
#include<iostream.h>

void writeinfile(int n);

int main()
{
        int m,k,j,n=0;
        for(m=1;m<=1000;m++)
        {
            /**********Program**********/
        




            /**********  End  **********/
        }
        writeinfile(n);
        return 0;
}

void writeinfile(int n)
{
        fstream myfile;
        myfile.open("f.txt",ios::out);
        myfile<<n<<endl;
        myfile.close();
}




/* ───────── 参考答案 ─────────
int i=1;
		k=m;
		j=m*m;
		while(k!=0)
		{
			k/=10;
			i*=10;
		}
		if(j%i==m)
			n++;
   ─────────────────────────── */
