/*
 * 来源：C++题库 题号589
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第68题
 *
 * 题目：已知10个四位数输出所有对称数及个数 n
 */

第68题 （0.1分）        题号:589        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 已知10个四位数输出所有对称数及个数 n
       例如1221，2332都是对称数

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream>
#include<iostream>
using namespace std;

#include <stdio.h>

void writeinfile(int n);

void main()
{
int i,n=0,m[10]={1221,2243,2332,1435,1236,5623,4321,4356,6754,3234};
for(i=0;i<10;i++)
{
/**********Program**********/



/**********  End  **********/
}
writeinfile(n);
}

void writeinfile(int n)
{
fstream myfile;
myfile.open("f.txt",ios::out);
myfile<<n<<endl;
myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
int a,b,c,d;
a=m[i]/1000;
b=m[i]%1000/100;
c=m[i]%100/10;
d=m[i]%10;
if(a==d&&c==b)
{cout<<m[i];
n++;}
----------------------
   ─────────────────────────── */
