/*
 * 来源：C++题库 题号591
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第70题
 *
 * 题目：用“辗转相除方法”计算两个数 x,y 的最大公约
 */

第70题 （0.1分）        题号:591        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 用“辗转相除方法”计算两个数 x,y 的最大公约
       数

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream>
#include<iostream>
using namespace std;

#include <stdio.h>

void writeinfile(int n);

void main()
{
int x,y,n;
x=25,y=10;
/**********Program**********/



/**********  End  **********/
cout<<y;
writeinfile(y);
}

void writeinfile(int n)
{
fstream myfile;
myfile.open("f.txt",ios::out);
myfile<<n<<endl;
myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
n=x%y;
while(n!=0)
{x=y;y=n;n=x%y;}
----------------------
   ─────────────────────────── */
