/*
 * 来源：C++题库 题号592
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第71题
 *
 * 题目：利用选择法将10个数按降序排列
 */

第71题 （0.1分）        题号:592        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 利用选择法将10个数按降序排列

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream>
#include<iostream>
using namespace std;
#include <stdio.h>

void writeinfile(int n[]);

void main()
{
int n[10]={5,6,4,2,3,7,8,5,6,7},i,j,k,t;
/**********Program**********/


/**********  End  **********/
for(i=0;i<10;i++)
cout<<n[i]<<" ";
writeinfile(n);
}

void writeinfile(int n[])
{
int k;
fstream myfile;
myfile.open("f.txt",ios::out);
for(k=0;k<10;k++)
myfile<<n[k]<<endl;

myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
for(i=0;i<9;i++)
{k=i;
for(j=i+1;j<10;j++)
if(n[k]<n[j])
k=j;
t=n[i];n[i]=n[k];n[k]=t;}
----------------------
   ─────────────────────────── */
