/*
 * 来源：C++题库 题号594
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第73题
 *
 * 题目：从若干学生成绩中统计高于平均分的人数k，用-1
 */

第73题 （0.1分）        题号:594        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：从若干学生成绩中统计高于平均分的人数k，用-1
      做为学生成绩数据的结束标志（说明：数组cj表示
      学生成绩）。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream>
#include<iostream>
using namespace std;

#include <stdio.h>

void writeinfile(int n);

void main()
{ float cj[]={76,89,90,67,56,45,24,87,66,56,-1},aver,sum=0;
int n=0,k=0,i;
/**********Program**********/



/**********  End  **********/
writeinfile(k);
}

void writeinfile(int n)
{
fstream myfile;
myfile.open("f.txt",ios::out);
myfile<<n<<endl;
myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
while(cj[n]>=0)
{sum+=cj[n]; n++;}
aver=sum/n;
for(i=0;i<n;i++)
if(cj[i]>aver) k++;
cout<<k;
----------------------
   ─────────────────────────── */
