/*
 * 来源：C++题库 题号599
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第78题
 *
 * 题目：求具有10个数的数组中的最大值和次最大值，并
 */

第78题 （0.1分）        题号:599        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 求具有10个数的数组中的最大值和次最大值，并
       把最大值和a[0]中的数对调，次最大数和a[1]中
       的数对调。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream>
#include<iostream>
using namespace std;

#include <stdio.h>

void writeinfile(int a[ ]);

void main()
{
int  a[10]={39,-47,21,2,-8,15,98,-3,87,56},max,cmax,j,l,i,t,m,n;
/**********Program**********/



/**********  End  **********/
writeinfile(a);
}

void writeinfile(int a[ ])
{
int k;
fstream myfile;
myfile.open("f.txt",ios::out);
for(k=0;k<10;k++)
myfile<<a[k]<<endl;
myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
max=a[0];
cmax=a[1];
for(i=1;i<10;i++)
 if(a[i]>max)
  {max=a[i];
   m=i;}
t=a[0];
a[0]=a[m];
a[m]=t;
for(j=2;j<10;j++)
  if(a[j]>cmax)
   {cmax=a[j];
   n=j;}
l=a[1];
a[1]=a[n];
a[n]=l;
----------------------
   ─────────────────────────── */
