/*
 * 来源：C++题库 题号602
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第80题
 *
 * 题目：已知10个数求最大值及最小值以及它们的差
 */

第80题 （0.1分）        题号:602        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 已知10个数求最大值及最小值以及它们的差。例如
       输入8，92，7，8，1，56，37，23，25，26则输出
       max=92，min=1，ca=91。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream>
#include<iostream>
using namespace std;

#include <stdio.h>

void writeinfile(int max,int min,int ca);

void main()
{
int a[ ]={8,92,7,8,1,56,37,23,25,26},max,min,ca,i;
/**********Program**********/


/**********  End  **********/
writeinfile(max,min,ca);
}

void writeinfile(int max,int min,int ca)
{
fstream myfile;
myfile.open("f.txt",ios::out);
myfile<<max<<","<<min<<","<<ca<<endl;
myfile.close();
}



/* ───────── 参考答案 ─────────
----------------------
max=min=a[0];
for(i=0;i<10;i++)
{if(a[i]>max)max=a[i];
if(a[i]<min)min=a[i];}
ca=max-min;
----------------------
   ─────────────────────────── */
