/*
 * 来源：C++题库 题号604
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第82题
 *
 * 题目：一个数列，它的第一项是0，第二项是1，以后每
 */

第82题 （0.1分）        题号:604        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 一个数列，它的第一项是0，第二项是1，以后每
      项都是前两项之和，求前20项之和 s

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<fstream.h>
#include<iostream.h>
#include <stdio.h>

void writeinfile(int n);

int main()
{
int k,a1=0,a2=1,s=a1+a2;
/**********Program**********/


/**********  End  **********/
writeinfile(s);
return 0;
}

void writeinfile(int n)
{
fstream myfile;
myfile.open("f.txt",ios::out);
myfile<<n<<endl;
myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
for(k=2;k<=10;k++)
{a1=a1+a2;
a2=a1+a2;
s=s+a1+a2;}
----------------------
   ─────────────────────────── */
