/*
 * 来源：C++题库 题号607
 * 章节：第2章-流程控制
 * 难度：中
 * 题序：第84题
 *
 * 题目：编写一个函数，统计出一维数组中
 */

第84题 （0.1分）        题号:607        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 编写一个函数，统计出一维数组中
       大于等于所有元素平均值的元素个数并返回它。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/


#include<fstream>
#include<iostream>
using namespace std;

int Count(double a[], int n)
{
/**********Program**********/



        
/**********  End  **********/

}
void main()
{
        int c;
        double a[10] = {34,54,75,86,53,45,34,45,34,45};

        c=Count(a,10);
        cout<<"数组中大于等于所有元素平均值的元素个数为："<<c;
        void wwjt(int);
        wwjt(c);
}
void wwjt(int o)
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile<<o<<endl;
        myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
	double m=0; 
	int i;
	for(i=0;i<n;i++) m+=a[i]; 
	m=m/n;
	int c=0;
	for(i=0;i<n;i++) 
		if(a[i]>=m) c++;
	return c;
----------------------
   ─────────────────────────── */
