/*
 * 来源：C++题库 题号8
 * 章节：第2章-流程控制
 * 难度：较难
 * 题序：第5题
 *
 * 题目：程序中的函数tax计算个人所得税，根据工资m返回其应征的税款
 */

第5题 （0.1分）        题号:8        难度:较难        第2章
/*----------------------------------------------------------
【程序设计】
------------------------------------------------------------

题目：程序中的函数tax计算个人所得税，根据工资m返回其应征的税款。
      个人所得税率表如下：
      月收入1200元起征，
      超过起征点1000元(含)以内，超过1200元的部分按5%征税；
      超过起征点3000元(含)以内，超过1200元的部分按10%征税；
      超过起征点5000元(含)以内，超过1200元的部分按15%征税；
      超过起征点10000元(含)以内，超过1200元的部分按20%征税；
      超过起征点10000元以上的，超过1200元的部分按30%征税。

------------------------------------------------------------
注意：仅在标有"Program"和"End"的注释行之间补充填写代码。
      请勿改动主函数main和其它任何已有内容。
------------------------------------------------------------*/

#include<iostream.h>
#include<fstream.h>


double tax(double m)
{
    /**********Program**********/





    /**********  End  **********/
}

int grading();
int main()
{
    double income, j=0;
        
    cout<<"请输入个人月收入："<<endl;
    cin>>income;

    j=tax(income);
    cout<<"应征所得税："<<j<<endl;

//忽略阅读
    grading();
//忽略阅读结束

    return 0;
}

//以下忽略阅读
int grading()
{
        int m;
        fstream infile, outfile;

        infile.open ("in.txt",ios::in);
        outfile.open("out.txt",ios::out);

        for (int i=0;i<5;i++)
        {
                infile>>m;
                outfile<<tax(m)<<endl;
        }

        infile.close();
        outfile.close();
        return 0;
}      



/* ───────── 参考答案 ─────────
double result=0;

    if (m<=1200)
		result=0;
	else if (m<=1200+1000)
		result=(m-1200)*0.05;
	else if (m<=1200+3000)
		result=(m-1200)*0.1;
    else if (m<=1200+5000)
		result=(m-1200)*0.15;
    else if (m<=1200+10000)
		result=(m-1200)*0.2;
    else if (m>1200+10000)
		result=(m-1200)*0.3;

    return result;
   ─────────────────────────── */
