/*------------------------------------------------
【程序设计】
--------------------------------------------------
题目：编写函数求文件中一系列整数的和。假设第一个读取的整数指定后面要输入的数值
      的个数。典型的输入序列如下：5  100  200  300  400  500。
      数据已经在文件in.txt中，编写函数读取并计算。

--------------------------------------------------
注意：部分源程序给出如下。仅在标有"Program"和"End"的注释行之间补充代码，
      请勿改动其它内容。
------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

void gfkd(int);


int sum( )
{
/**********Program**********/




/**********  End  **********/
}

int main()
{gfkd(sum());
 return 0;
}

void gfkd(int num)
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile<<num;
        myfile.close();
}
