/*
 * 来源：C++题库 题号970
 * 章节：第9章-综合程序设计
 * 难度：中
 * 题序：第106题
 *
 * 题目：请完成函数rev()，函数rev的原型如下：
 */

第106题 （0.1分）        题号:970        难度:中        第9章
/*------------------------------------------------
【程序设计】
--------------------------------------------------
题目：请完成函数rev()，函数rev的原型如下：
      int rev(int n);
      该函数将一个四位正整数n逆序后再乘以2的值返回。
      例如，n为2345，逆序后为5432，函数的返回值为10864。
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除"program"和
      "End"两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
void grading();

int rev(int n);
/**********Program**********/


/**********  End  **********/

int main()
{   
    int n = 2345;
    cout << "rev(" << n << ")=" << rev(n) << endl; 
//忽略阅读
    grading();
    system("pause");
//忽略阅读结束  
    return 0;
}

//以下忽略阅读
void grading()
{
    int n, t;
    ifstream inF("in.txt");
    ofstream outF("out.txt");
    for (int i=0;i<10;i++)
    {   
        n = 0;
        for(int j=0;j<100;j++)
        {
            inF>>t;
            n += t;
        }
        n = n % 10000;
        outF<<rev(n)<<endl;
    }    
}



/* ───────── 参考答案 ─────────
int rev(int n)
{   
    int a;
    a = n%10 *1000 + n/10%10 *100 + n/100%10 *10+ n/1000;
    return a*2;
}
   ─────────────────────────── */
