/*
 * 来源：C++题库 题号975
 * 章节：第9章-综合程序设计
 * 难度：中
 * 题序：第111题
 *
 * 题目：给定一个n(n>=2)行10列的整数矩阵，函数maxMin()
 */

第111题 （0.1分）        题号:975        难度:中        第9章
/*------------------------------------------------
【程序设计】
--------------------------------------------------
题目：给定一个n(n>=2)行10列的整数矩阵，函数maxMin()
      计算矩阵最外围元素(指第一行、最后一行的元素，
      以及第一列、最后一列的元素)的最大值和最小值，
      并将最大值存入全局变量mX，最小值存入全局变量mN。
      请完成该函数功能，函数的第一个参数a是二维整数
      矩阵，第二个参数n是矩阵的行数(n<=10)。 
      例如，main函数中测试数据data描述了一个3行10列的矩阵，
      该矩阵最外围元素的最大值、最小值分别是101、2，
      则mX、mN的值分别为101、2。 
     
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除"program"和
      "End"两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

void grading();

int mX, mN;

void maxMin(int a[][10], int n)
{   
/**********Program**********/
    
    
/**********  End  **********/
} 

int main()
{   
    int data[3][10] = {
        {100,2,3,4,5,6,7,8,9,101}, 
        {100,1,1,1,1,1,1,1,1,101},
        {100,2,3,4,5,6,7,8,9,101}
    };
    
    maxMin(data, 3);
    cout << "mX = " << mX << "\tmN = " << mN << endl;
//忽略阅读
    grading();
    system("pause");
//忽略阅读结束   
    return 0;
}

//以下忽略阅读
void grading()
{   
    int a[10][10], r=3;

    ifstream inF("in.txt");
    ofstream outF("out.txt");
    for(int i=0; i<10; i++)
    {   
        for(int j=0; j<r; j++)
            for (int k=0;k<10;k++)
            inF>>a[j][k];
      
        maxMin(a, r++);
        if(r>10) 
            r = 3;
        outF<<mX<<" "<<mN<<endl;
    }
}



/* ───────── 参考答案 ─────────
int x[100], c=0;
    int i;
    for(i=0; i<10; i++) 
    {   
	x[c++] = a[0][i];
        x[c++] = a[n-1][i];
    } 
    for(i=0; i<n; i++)
    {   
	x[c++] = a[i][0];
        x[c++] = a[i][9];
    }
    
    mX = mN = x[0];
    for(i=1; i<c; i++)
    {   
	if(mX<x[i]) 
		mX = x[i];
        if(mN>x[i]) 
		mN = x[i];
    }
   ─────────────────────────── */
