/*
 * 来源：C++题库 题号540
 * 章节：第5章-指针
 * 难度：易
 * 题序：第51题
 *
 * 题目：下图给出了至第5行杨辉三角形，请找出其规律，打印杨辉三角形至第30行
 */

第51题 （0.1分）        题号:540        难度:易        第5章
/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：下图给出了至第5行杨辉三角形，请找出其规律，打印杨辉三角形至第30行。要求使用二维数组来保存，并利用给定的输出函数将其打印出来。
1 
1 1 
1 2 1 
1 3 3 1 
1 4 6 4 1
--------------------------------------------------------------------------------
注意：
1.部分源程序给出如下。请勿改动主函数main和其它函数中的任何内容，仅在*program*
  和*end*所标记的区域内完成题干要求的函数功能。
2.//忽略阅读与//忽略阅读结束内的程序可以忽略阅读。
------------------------------------------------------------------------------*/
#include <iostream>
#include <fstream>

using namespace std;

void output(int a[][31]);

//打印杨辉三角形函数
void fun(int a[][31])
{
/********Program********/


/********  End  ********/
}

void output(int a[][31])
{
        int i, j;
        ofstream outfile("f2.txt", ios::out);
        if(!outfile.is_open())
        {
                cerr << "Open file f2.txt error!" << endl;
                exit(1);
        }
        for(i=0;i<30;i++)
        {
                for(j=1;j< i + 1;j++)        
                {
                        if(a[i][j] == 0)
                                outfile << "  ";
                        else
                                outfile<<a[i][j]<<" ";
                }
                outfile<<endl;
        }
        outfile.close();
}

int main()
{
        int a[30][31]={0,1};
    fun(a);
    //忽略阅读
    output(a);
   //忽略阅读结束

        cout <<"Press the enter key to exit!" << endl;
   cin.ignore(cin.rdbuf()->in_avail() + 1);
   return 0;
}



/* ───────── 参考答案 ─────────
----------------------
int i,j;       //初始化时写好第1行，其余各行全0

	for(i=1;i<30;i++)           
		for(j=1;j< i + 1;j++)
			a[i][j]=a[i-1][j-1]+a[i-1][j];

----------------------
   ─────────────────────────── */
