/*
 * 第53题 (题号:542)  难度:中  第5章
 *
 * 【程序设计】
 *
 * 题目：编程定义一个整型(ival及指针(*ip)、一个双精度型(dval)及指针(*dp)、一个字符
 *       型(cval)及指针及指针(*cp)，并赋初值(100,99.9.'A')，然后显示各指针所指目标
 *       的值与地址，各指针的值与指针本身的地址及各指针所占字节数（长度）。
 *       *其中地址用十六进制显示。
 *
 * 注意：1.输出结果参照样张图片。
 *       2.属性、操作名称与题目保持一致。
 *
 * 注意：
 * 1.部分源程序给出如下。请勿改动主函数main和其它函数中的任何内容，仅在*program*
 *   和*end*所标记的区域内完成题干要求的函数功能。
 * 2.//忽略阅读与//忽略阅读结束内的程序可以忽略阅读。
 */

#include<iostream>
#include<fstream>
#include <cstdlib>
#include <cmath>
using namespace std;
void wwjt();

void main()
{

        /*******Program*******/



        /*******  End  *******/
   //忽略阅读
    wwjt();
   //忽略阅读结束
   return ;
}
