/*
 * 来源：C++题库 题号617
 * 章节：第5章-指针
 * 难度：中
 * 题序：第89题
 *
 * 题目：请编写函数
 */

第89题 （0.1分）        题号:617        难度:中        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：请编写函数
          int occ_num(int a[], int x, int len)
     计算整数 x 在数组 a 中出现的次数，其中 len
     为数组a的长度。

--------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中介于
      "**********Program**********"
      和
      "**********  End  **********"
      的部分填入所编写的若干语句。

------------------------------------------------*/

#include<iostream>
#include <fstream>
using namespace std;

#define N 20

int occ_num(int a[], int x, int len)
{
/**********Program**********/




/**********  End  **********/
}

int main()
{ 
    ifstream inf("in.dat",ios::in);
    ofstream ouf("out.dat",ios::out);
    int a[N];
    for(int i=0;i<N;i++)
       inf>>a[i];
    ouf<< occ_num(a,a[1],N)<<endl;
    inf.close();
    ouf.close();
    return 0;  
}



/* ───────── 参考答案 ─────────
----------------------
int m =0;
for(int i=0;i<len;i++)
if(a[i]==x)
   m++;
return m;

----------------------
   ─────────────────────────── */
