/*
 * 来源：C++题库 题号643
 * 章节：第5章-指针
 * 难度：较易
 * 题序：第109题
 *
 * 题目：下面的程序计算一个4*5的浮点数组s中每列的平均值，
 */

第109题 （0.1分）        题号:643        难度:较易        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：下面的程序计算一个4*5的浮点数组s中每列的平均值，
并将结果存入到数组ave中，如第0列的平均值存入到ave[0]中。
完成该程序。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream>
#include<iostream>
using namespace std;

int main()
{
        float s[4][5], ave[5];
        int i,j;
        fstream infile,outfile;
        infile.open("in.txt",ios::in);
        outfile.open("out.txt",ios::out);
        for (i=0;i<4;i++)
                for (j=0;j<5;j++)
                        infile>>s[i][j];
/**********Program**********/
        
/**********  End  **********/
        for (j=0;j<5;j++)
                outfile<<ave[j]<<endl;
        infile.close();
        outfile.close();
        return 0;
}




/* ───────── 参考答案 ─────────
for (j=0;j<5;j++)
	{
		float m=0;
		for (i=0;i<4;i++)
			m+=s[i][j];
		m = m/4;
		ave[j] = m;
	}
   ─────────────────────────── */
