/*
 * 来源：C++题库 题号671
 * 章节：第5章-指针
 * 难度：中
 * 题序：第133题
 *
 * 题目：函数mySum(int m, int n)返回m! + (m+1)! + (m+2)!
 */

第133题 （0.1分）        题号:671        难度:中        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：函数mySum(int m, int n)返回m! + (m+1)! + (m+2)!
      + … + n!的值，n大于m。填写适当的代码，使得
      mySum()完成正确的功能。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<iostream>
#include <fstream>
using namespace std;

int mySum(int m, int n);
int grading();

int main()
{
        cout << mySum(1, 5) << endl;
        
        //忽略阅读
        grading();
        //忽略阅读结束
        
        return 0;
}

int mySum(int m, int n)
{
        /*************** Program *****************/
        






        
        /*************** End *****************/
}

//以下忽略阅读
int grading()
{
       fstream myF;
        
       myF.open("out.txt",ios::out);
       myF << mySum(2, 10);
       myF.close();
       return 0;
}



/* ───────── 参考答案 ─────────
int i, p=1, s;
	for (i=1; i<=m; i++)
		p=p*i;
	s=p;
	for (i=m+1; i<=n; i++)
	{	p = p*i;
	s = s + p;
	}
	
	return s;
   ─────────────────────────── */
