/*
 * 来源：C++题库 题号712
 * 章节：第5章-指针
 * 难度：易
 * 题序：第164题
 *
 * 题目：编写函数addto，求一个10*10的二维整型数组中所
 */

第164题 （0.1分）        题号:712        难度:易        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写函数addto，求一个10*10的二维整型数组中所
      有偶数的和，并返回结果。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅仅在标有"Program"和"End"
      的注释行之间补充填写代码。
------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

//len传递二维数组的行数：
int addto(int b[][10], int len)
{
        int sum=0;

        /**********Program**********/





        /**********  End  **********/

        return sum;
}

int grading();
int main()
{
        int result;
        int a[10][10] = {{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}, 
        {11, 12, 13, 14, 15, 16, 17, 18, 19, 20},
        {21, 22, 23, 24, 25, 26, 27, 28, 29, 30},
        {31, 32, 33, 34, 35, 36, 37, 38, 39, 40}, 
        {41, 42, 43, 44, 45, 46, 47, 48, 49, 50}, 
        {51, 52, 53, 54, 55, 56, 57, 58, 59, 60}, 
        {61, 62, 63, 64, 65, 66, 67, 68, 69, 70}, 
        {71, 72, 73, 74, 75, 76, 77, 78, 79, 80}, 
        {81, 82, 83, 84, 85, 86, 87, 88, 89, 90}, 
        {91, 92, 93, 94, 95, 96, 97, 98, 99, 100}}; 

        result = addto(a,10);
        cout << "给定的二维整型数组中所有偶数的和是：" ;
        cout << result << endl;

//忽略阅读
        grading();
//忽略阅读结束

        return 0;
}

//以下忽略阅读
int grading()
{
        int a[10][10], result;
        fstream ifile, myfile;
        ifile.open ("in.txt",ios::in);
        myfile.open("out.txt",ios::out);
        for (int k=0;k<4;k++)
        {
                for(int i=0; i<10; i++)
                        for(int j=0; j<10; j++)
                                ifile>>a[i][j];
                result = addto(a,10);
                myfile<<result<<endl;
        }
        ifile.close();
        myfile.close();
        return 0;
}


/* ───────── 参考答案 ─────────
for(int i=0; i<len; i++)
		for(int j=0; j<10; j++)
			if( b[i][j]%2==0)
				sum = sum + b[i][j];
   ─────────────────────────── */
