//自建题库第163题   题号:719
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：文件infile163.txt中含有两个用空格分隔的长度
      不超过10的英语单词，请将这两个英语单词依次读
      入两个一维字符数组str1和str2中，并比较两个单
      词长度，若str1 单词字母个数多于str2，结果为1；
      若str1单词字母个数等于str2，结果为0；若str1
      单词字母个数少于str2，结果为-1。将比较结果
      result输出到文件out163.txt中。
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include <fstream.h>
#include <stdlib.h>
#include <cstring>

int main()
{
        ifstream ifile;
        fstream myfile;
        char str1[11], str2[11];
        int result;

        /**********Program**********/








        /**********  End  **********/
        myfile << result << endl;

        ifile.close();
        myfile.close();
        return 0;
}
