/*
 * 来源：C++题库 题号720
 * 章节：第5章-指针
 * 难度：中
 * 题序：第169题
 *
 * 题目：下面的函数countchar统计字符串s中非英文字母的
 */

第169题 （0.1分）        题号:720        难度:中        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：下面的函数countchar统计字符串s中非英文字母的
      个数并返回。完成该函数的编写。
  
--------------------------------------------------
        
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
          
------------------------------------------------*/

#include <fstream>
using namespace std;

int countchar(char s[])
{
/**********Program**********/        

        
        
        
/**********  End  **********/
        
}

int main()
{
        char str[201];
        int count;
        
        for(int i=0; i<150; i++)
                str[i] = rand()%91 + 33; 
        str[i] = '\0';
        
        count = countchar(str);
        
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile << count << endl;
        myfile.close();
        return 0;
}



/* ───────── 参考答案 ─────────
int i = 0, cou=0;
	
	while(s[i]!='\0')
	{
		if( !(s[i]>='A' && s[i]<='Z' || s[i]>='a' && s[i]<='z') )
			cou++;
		i++;
	}
        return cou;
   ─────────────────────────── */
