/*
 * 来源：C++题库 题号784
 * 章节：第5章-指针
 * 难度：中
 * 题序：第184题
 *
 * 题目：函数sum计算二维数组a中前m行n列的周边元素的累加
 */

第184题 （0.1分）        题号:784        难度:中        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：函数sum计算二维数组a中前m行n列的周边元素的累加
      和并返回，其中2<=m,n<=100。如果a中的数据为：
          1 2 3 4 5 6 7 8....
          2 3 4 5 6 7 8 9....
          3 4 5 6 7 8 9 10....
          4 5 6 7 8 9 10 11....
          ....
      前1行1列只有一个1，则sum(a,1,1)的值为1，前3行
      4列为：
          1 2 3 4
          2 3 4 5
          3 4 5 6
      则sum(a,3,4)计算其周边元素之和为35。
      编程实现函数sum。
  
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除“program”和
      “End”两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
void grading();
int sum(int a[][100], int m, int n);

/**********Program**********/


/**********  End  **********/

int main()
{
        int b[100][100]={{1,2,3,4,5,6,7,8},{2,3,4,5,6,7,8,9},
        {3,4,5,6,7,8,9,10},{4,5,6,7,8,9,10,11}};
        int s;
        s=sum(b,1,1);
        cout<<"1行1列数组周边元素和为:"<<s<<endl;
        s=sum(b,3,4);
        cout<<"3行4列数组周边元素和为:"<<s<<endl;
        grading();
        return 0;
}

//以下忽略阅读
void grading()
{
        int b[100][100];
        int i,j,n,s;
        fstream infile,outfile;
        infile.open("in.txt",ios::in);
        outfile.open("out.txt",ios::out);
        for (i=0;i<40;i++)
        {
                for(j=0;j<40;j++)
                {
                        infile>>n;
                        b[i][j]=n%100;
                }
        }
        for (i=10;i<20;i++)
        {
                for(j=10;j<20;j++)
                {
                        s=sum(b,i,j);
                        outfile<<s<<" ";
                }
                outfile<<endl;
        }
        infile.close();
        outfile.close();
}



/* ───────── 参考答案 ─────────
int sum(int a[][100], int m, int n)
{
	int i,j,s=0;
	for(i=0;i<n;i++)
		for(j=0;j<m;j++)
			if(i==0||i==n-1||j==0||j==m-1)
				s+=a[i][j];
	return s;
}
   ─────────────────────────── */
