/*
 * 来源：C++题库 题号794
 * 章节：第5章-指针
 * 难度：中
 * 题序：第193题
 *
 * 题目：函数sum计算数组a中前n行n列组成的二维数组的左
 */

第193题 （0.1分）        题号:794        难度:中        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：函数sum计算数组a中前n行n列组成的二维数组的左
      下角（含对角线）元素的累加和并返回，其中2<=n<=100。
      例如数组中元素为：
          1,2,3,4,5...
          5,6,7,8,9...
          9,8,7,6,5...
          5,4,3,2,1...
          ......
      a中的前4行4列为：
          1,2,3,4
          5,6,7,8
          9,8,7,6
          5,4,3,2
          则sum(a,4)计算该二维数组左下角元素和为50。
      a中前3行3列为
          1,2,3
          5,6,7
          9,8,7
      则sum(a,3)计算该二维数组左下角元素和为36。
      实现函数sum。
  
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除“program”和
      “End”两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
void grading();
int sum(int a[][100], int n);

/**********Program**********/


/**********  End  **********/

int main()
{
        int b[100][100]={{1,2,3,4},{5,6,7,8},{9,8,7,6},{5,4,3,2}};
        int s=sum(b,4);
        cout<<"4*4二维数组左下角元素和为:"<<s<<endl;
        grading();
        return 0;
}

//以下忽略阅读
void grading()
{
        int b[100][100];
        int i,j,n,s;
        fstream infile,outfile;
        infile.open("in.txt",ios::in);
        outfile.open("out.txt",ios::out);
        for (i=0;i<40;i++)
        {
                for(j=0;j<40;j++)
                {
                        infile>>n;
                        b[i][j]=n%100;
                }
        }
        for (i=1;i<=40;i++)
        {
                s=sum(b,i);
                outfile<<s;
                if(i%4==0)
                        outfile<<endl;
                else
                        outfile<<" ";
        }
        infile.close();
        outfile.close();
}



/* ───────── 参考答案 ─────────
int sum(int a[][100], int n)
{
	int i,j,s=0;
	for(i=0;i<n;i++)
		for(j=0;j<=i;j++)
			s+=a[i][j];
	return s;
}
   ─────────────────────────── */
