/*
 * 来源：C++题库 题号983
 * 章节：第5章-指针
 * 难度：中
 * 题序：第221题
 *
 * 题目：编写一个递归函数，近似地计算黄金分割
 */

第221题 （0.1分）        题号:983        难度:中        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

  题目：编写一个递归函数，近似地计算黄金分割。计算公式如下：
  F(n)   = 1                  if n = 0
  F(n)   = 1 + 1 / F(n-1)     if n > 0

  例如：F(10) = 1.61798
  
--------------------------------------------------
        注意：部分源程序给出如下。请勿改动主函数main和其它
        函数中的任何内容，不要修改或删除“program”和
        “End”两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>

using namespace std;
void grading();
double F(int n);

/**********Program**********/


/**********  End  **********/


int main()
{
        cout << F(10) << endl;
        grading();
        return 0;
}

//以下忽略阅读
void grading()
{
        int i,j,n,k;
        fstream infile,outfile;
        infile.open("in.txt",ios::in);
        outfile.open("out.txt",ios::out);
        for (i=0;i<10;i++)
        {
                outfile << F(i * 2 + 1) << endl;
        }
        infile.close();
        outfile.close();
}




/* ───────── 参考答案 ─────────
double F(int n)
{
	if (n == 0)
		return 1;
	else
		return 1 + 1 / F(n - 1);
}


********************第6章以后*******************


试卷编号：9565
所属语言：C++
试卷方案：>=6
试卷总分：11.90001分
共有题型：1种


一、程序设计   共119题 （共计11.90001分）
   ─────────────────────────── */
