/*
 * 来源：C++题库 题号523
 * 章节：第3章-函数
 * 难度：中
 * 题序：第41题
 *
 * 题目：设计一个函数GCD，求两个数 m 和 n的最大公约数（假设 m>n>0）
 */

第41题 （0.1分）        题号:523        难度:中        第3章
/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：设计一个函数GCD，求两个数 m 和 n的最大公约数（假设 m>n>0） 。
 
--------------------------------------------------------------------------------
注意：
1.部分源程序给出如下。请勿改动主函数main和其它函数中的任何内容，仅在*program*
  和*end*所标记的区域内完成题干要求的函数功能。
  2.//忽略阅读与//忽略阅读结束内的程序可以忽略阅读。
------------------------------------------------------------------------------*/
#include<iostream>
#include<fstream>
using namespace std;


int GCD (int x, int y)
{
/*********Program*********/




/*********  End  *********/
}

//忽略阅读
int main()
{
        int m,n;
        fstream infile, outfile;
        infile.open ("in.dat",ios::in);
        outfile.open("out.dat",ios::out);
        
        infile>>m;
        infile>>n;
        outfile<<GCD(m,n)<<endl;

        infile.close();
        outfile.close();

       return 0;
}



/* ───────── 参考答案 ─────────
int k= m%n;
    while (k)
    {
        m=n; n=k; k=m%n;
    }
    return n;
}
   ─────────────────────────── */
