/*
 * 来源：C++题库 题号526
 * 章节：第3章-函数
 * 难度：中
 * 题序：第44题
 *
 * 题目：题目：设计函数PrintDiagram(m)打印直方图，直方图宽度为3行，每列代表数据1％
 */

第44题 （0.1分）        题号:526        难度:中        第3章
/*------------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------------

题目：题目：设计函数PrintDiagram(m)打印直方图，直方图宽度为3行，每列代表数据1％。
      运行结果如样张所示。
        
--------------------------------------------------------------------------------
注意：
1.部分源程序给出如下。请勿改动主函数main和其它函数中的任何内容，仅在*program*
  和*end*所标记的区域内完成题干要求的函数功能。
2.//忽略阅读与//忽略阅读结束内的程序可以忽略阅读。
------------------------------------------------------------------------------*/
#include<iostream>
#include<fstream>
using namespace std;

/*********Program*********/




/*********  End  *********/

void main()
{
        PrintDiagram(10);
        PrintDiagram(15);
        PrintDiagram(7);

        return ;
}




/* ───────── 参考答案 ─────────
void PrintDiagram(int m){
	int i ;
	cout<<'|'<<endl;
	for(i=0;i<3;i++){
		cout<<'|';
		for(int j=0;j<m;j++) 
			cout<<'*';
		cout<<endl;
	}
	cout<<'|'<<endl;
}
   ─────────────────────────── */
