/*
 * 来源：C++题库 题号586
 * 章节：第3章-函数
 * 难度：中
 * 题序：第65题
 *
 * 题目：编写函数getSum()求整数m的各位数字之和并返回该值
 */

第65题 （0.1分）        题号:586        难度:中        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 编写函数getSum()求整数m的各位数字之和并返回该值。
       例如m＝252时，各位数字之和为9。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/
#include<fstream>
#include<iostream>
using namespace std;

#include <stdio.h>

void writeinfile();

int getSum(int m)
{
/**********Program**********/





/**********  End  **********/
}
void main()
{
int m,s=0;
m=252;
s=getSum(m);
cout<<s;
writeinfile();
}

void writeinfile()
{
fstream myfile;
myfile.open("f2.txt",ios::out);
myfile<<getSum(252)<<endl;
myfile<<getSum(1457)<<endl;
myfile.close();
}


/* ───────── 参考答案 ─────────
----------------------
int s=0,n;
while( m!=0)
{n=m%10;s+=n;m=m/10;}
return s;
----------------------
   ─────────────────────────── */
