/*
 * 来源：C++题库 题号614
 * 章节：第3章-函数
 * 难度：较易
 * 题序：第86题
 *
 * 题目：编写一个函数compose()，求解1、2、3、4四个数字
 */

第86题 （0.1分）        题号:614        难度:较易        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：编写一个函数compose()，求解1、2、3、4四个数字
      能组成多少个互不相同且无重复数字的三位数？

--------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。

------------------------------------------------*/

#include<fstream>
#include <iostream>
using namespace std;

void writeinfile(int n);

int compose()
{
/**********Program**********/



/**********  End  **********/
}

void main()
{
        int i=0;
        i=compose();
        cout << i << endl;

//忽略阅读开始
        writeinfile(i);
//忽略阅读结束

}

//以下忽略阅读
void writeinfile(int n)
{
        fstream myfile;
        myfile.open("f.txt",ios::out);
        myfile<<n<<endl;
        myfile.close();
}



/* ───────── 参考答案 ─────────
int i,j,k,n=0;
	for(i=1;i<5;i++)
		for(j=1;j<5;j++)
			for(k=1;k<5;k++)
				if (i!=k&&i!=j&&j!=k) 
					n++;
	cout<<"能组成"<<n<<"个互不相同且无重复数字的三位数";
	return n;
   ─────────────────────────── */
