/*
 * 来源：C++题库 题号616
 * 章节：第3章-函数
 * 难度：较易
 * 题序：第88题
 *
 * 题目：请编写函数
 */

第88题 （0.1分）        题号:616        难度:较易        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 请编写函数
             int  num_of_facs(int n);
      计算一个正整数 n 的因子个数（包括1和自身）。

--------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中介于
      "**********Program**********"
      和
      "**********  End  **********"
      的部分填入所编写的若干语句。

------------------------------------------------*/



#include<iostream>
#include <fstream>
using namespace std;


int  num_of_facs(int n)
{
/**********Program**********/




/**********  End  **********/
}

int main()
{
    int m, n;  
    ifstream inf("in.dat",ios::in);
    inf >> m >>n;
    ofstream ouf("out.dat",ios::out);
    ouf << num_of_facs(m) << endl;
    ouf << num_of_facs(n) <<endl;
    inf.close();
    ouf.close();
    return 0;  
}



/* ───────── 参考答案 ─────────
----------------------
int m =0;
for(int i=1;i<n;i++)
  if(!(n%i))
     m++;
m++;
return m;

----------------------
   ─────────────────────────── */
