/*
 * 来源：C++题库 题号625
 * 章节：第3章-函数
 * 难度：中
 * 题序：第93题
 *
 * 题目：编写一个函数
 */

第93题 （0.1分）        题号:625        难度:中        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 编写一个函数
       int cap_count(char* s)
      返回输入字符串 s 中大写字母的个数。

--------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数 main 
      和其它函数中的任何内容，仅在程序中介于
      "**********Program**********"
      和
      "**********  End  **********"
      的部分填入所编写的若干语句。

------------------------------------------------*/

#include<iostream>
#include<fstream>

using namespace std;

#define N 30

int cap_count(char* s)
{
/**********Program**********/

/**********  End  **********/
}

int main()
{
    ifstream inf("in.txt",ios::in);
    ofstream ouf("out.txt",ios::out);
    char s[N];
    while(inf>>s)
       ouf << cap_count(s) << endl;
    inf.close();
    ouf.close();
    return 0;    
}


/* ───────── 参考答案 ─────────
int c=0;
	while(*s)
	{
		if(*s>='A' && *s<='Z')
			c++;
		s++;
	}
	return c;
   ─────────────────────────── */
