/*
 * 来源：C++题库 题号627
 * 章节：第3章-函数
 * 难度：易
 * 题序：第95题
 *
 * 题目：求100以内(不含100)能被3整除且个位数为6的所有整数，
 */

第95题 （0.1分）        题号:627        难度:易        第3章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：求100以内(不含100)能被3整除且个位数为6的所有整数，
      并按从小到大的顺序存入数组a中。

-------------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。

-------------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
void wwjt(int b[]);

int main()
{
        int a[50]={0};


/**********Program**********/



/**********  End  **********/

        wwjt(a);
        return 0;
}

void wwjt(int b[])
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        int i = 0;
    while(b[i]!=0)
        {
                myfile<<b[i]<<' '<<endl;
                i++;
        }
        myfile.close();        
}



/* ───────── 参考答案 ─────────
----------------------
	int i,count=0;
	for(i=0;i<100;i++)
		if(i%3==0 && i%10==6)
		{
			a[count++]=i;
			cout<<i<<" ";
		}

----------------------
   ─────────────────────────── */
