/*
 * 来源：C++题库 题号660
 * 章节：第3章-函数
 * 难度：较易
 * 题序：第126题
 *
 * 题目：将1元钱换成1分、2分、5分的硬币，问共有多少种
 */

第126题 （0.1分）        题号:660        难度:较易        第3章
/*--------------------------------------------------
【程序设计】
----------------------------------------------------

题目：将1元钱换成1分、2分、5分的硬币，问共有多少种
      换法？请将结果存入变量count。

---------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
---------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
void grading(int b);

int main()
{
        int count=0;
        
        /**********Program**********/
        






                                
        /**********  End  **********/
                                
        cout << "共有" << count << "种换法。" << endl;
                                
//忽略阅读
        grading(count);
//忽略阅读结束
                                
        return 0;
}

//以下忽略阅读
void grading(int b)
{
        fstream myfile;
        myfile.open("out.txt",ios::out);
        myfile<<b<<' '<<endl;
        myfile.close();        
}



/* ───────── 参考答案 ─────────
int i,j,k;
	for(i=0;i<=100;i++)
		for(j=0;j<=100;j++)
			for(k=0;k<=100;k++)
				if(i+j*2+k*5==100) 
				{
					count++;
					cout<<i<<" "<<j<<" "<<k<<endl;
				}
   ─────────────────────────── */
