/*
 * 来源：C++题库 题号667
 * 章节：第3章-函数
 * 难度：中
 * 题序：第130题
 *
 * 题目：编程计算，计算公式如右图所示
 */

第130题 （0.1分）        题号:667        难度:中        第3章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编程计算，计算公式如右图所示。

-------------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。

------------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

int calc()
{
/**********Program**********/





/**********  End  **********/
}

void main(void)
{   

        int value;

        value = calc();

        cout << "累计和s为：" << value << endl;

        fstream outfile;
        outfile.open("out.txt", ios::out);
        outfile << "累计和s为：" << value << endl;
        outfile.close();

}



/* ───────── 参考答案 ─────────
int i, k, s;
	
	s=0;
	for (i=1; i<=20; i++)
		for (k=1; k<=3; k++)
			s = s + (i+1)*(i+1)*(k+2)*(k+2);
	return s;
   ─────────────────────────── */
