/*
 * 来源：C++题库 题号674
 * 章节：第3章-函数
 * 难度：中
 * 题序：第135题
 *
 * 题目：函数myLen(int n)返回整数n的位数
 */

第135题 （0.1分）        题号:674        难度:中        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：函数myLen(int n)返回整数n的位数。例如345的位
      数是3。填写适当的代码，使得myLen()完成正确的
          功能。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<iostream>
#include <fstream>
using namespace std;

int myLen(int n);
void gfkd();

void main()
{        
        cout << myLen(12345) << endl;

        // -------- main()函数此后部分可以不阅读 -----------
        gfkd();
}

int myLen(int n)
{
/*************** Program *****************/
        




/*************** End *****************/
}

void gfkd()
{        fstream myF;
        int n;

        myF.open("in.dat",ios::in);
        myF.read((char *)&n, sizeof(int));
    myF.close();

    myF.open("out.dat",ios::out);
        myF << myLen(n);
    myF.close();
}



/* ───────── 参考答案 ─────────
int c=0;
	
	while (n>0)
	{	n = n / 10;
		c++;
	}
	return c;
   ─────────────────────────── */
