/*
 * 来源：C++题库 题号675
 * 章节：第3章-函数
 * 难度：较难
 * 题序：第136题
 *
 * 题目：在一笼子里，鸡和兔的个数共m只，脚有n只，编写
 */

第136题 （0.1分）        题号:675        难度:较难        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：在一笼子里，鸡和兔的个数共m只，脚有n只，编写
      函数myChicken来计算鸡和兔各多少只？计算结果
      存放在参数c（鸡的只数）和r（兔的只数）中。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<iostream>
#include <fstream>
using namespace std;

// m: 鸡和兔的总个数；n: 脚的总只数；
// c: 存放计算出的鸡的只数；r: 存放计算出的兔的只数。
int myChicken(int m, int n, int &c, int &r);
int grading();

int main()
{
        int c, r;  // c: 存放计算出的鸡的只数；r: 存放计算出的兔的只数
        
        myChicken(100, 300, c, r); 
        cout << "共有" << c << "只鸡" << endl;
        cout << "共有" << r << "只兔" << endl;

//忽略阅读
        grading();
//忽略阅读结束

        return 0;
}

int myChicken(int m, int n, int &c, int &r)
{
        /*************** Program *****************/
        




        
        /*************** End *****************/
        
        return 0;
}

//以下忽略阅读
int grading()
{        
        fstream myF;
        int c, r;
        
        myF.open("out.txt",ios::out);
        myChicken(279, 870, c, r);
        myF << c <<' ' << r;
        myF.close();
        return 0;
}



/* ───────── 参考答案 ─────────
for (c=0; c<=m; c++){
		r = m - c;
		if ((c*2+r*4)==n)	
			break;
	}
   ─────────────────────────── */
