/*
 * 来源：C++题库 题号676
 * 章节：第3章-函数
 * 难度：较难
 * 题序：第137题
 *
 * 题目：有一群士兵，人数不超过n
 */

第137题 （0.1分）        题号:676        难度:较难        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：有一群士兵，人数不超过n。孙子将其按照一行3人
      排队，余2人；按照一行5人排队，余1人；按照一
          行7人排队，刚好排成若干行。编写函数myArmy()来
          计算士兵的人数。（提示：可以采用穷举法求解。）

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include<iostream>
#include <fstream>
using namespace std;

void myArmy(int n, int &c);
// n: 士兵人数不超过n
// c: 存放士兵的实际人数
void gfkd();

void main()
{        int        c;

        myArmy(100, c);
        cout << "士兵人数: " << c << endl;
        
        // -------- main()函数此后部分可以不阅读 -----------
        gfkd();
}

void myArmy(int n, int &c)
{
/*************** Program *****************/
        




/*************** End *****************/
}

void gfkd()
{        fstream myF;
        int c;

        myF.open("out.dat",ios::out);
        myArmy(100, c);
    myF << c;
    myF.close();
}
 


/* ───────── 参考答案 ─────────
for (c=1; c<=n; c++)
		if ((c%3==2) && (c%5==1) && (c%7==0))	return;
   ─────────────────────────── */
