/*
 * 来源：C++题库 题号695
 * 章节：第3章-函数
 * 难度：较易
 * 题序：第150题
 *
 * 题目：请输出个、十、百位数字各不相同的所有三位数，
 */

第150题 （0.1分）        题号:695        难度:较易        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：请输出个、十、百位数字各不相同的所有三位数，
      结果写入f2.txt中，60个数一行。

要求：输出时按从小到大的顺序输出。

--------------------------------------------------

注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在注释形式标识Program和
      End之间填入所编写的若干语句。

------------------------------------------------*/

#include <iostream.h>
#include <fstream.h>

int main()
{
        int i, j, k, count = 0;
        ofstream output;
        output.open("f2.txt", ios::out);

        /**********Program**********/



        /**********  End  **********/

        output.close();

        cout <<"Press the enter key to exit!" << endl;
        cin.ignore(cin.rdbuf()->in_avail() + 1);

        return 0;
}



/* ───────── 参考答案 ─────────
for(i = 0; i < 10; i++)
		for(j = 0; j < 10; j++)
			for(k = 1; k < 10; k++)
			{
				if(i != j && j != k && i != k)
				{
					output << k << j << i;
					count++;
					if(count == 60)
					{
						count = 0;
						output << endl;
					}
					else
						output << "	";
				}
			}
   ─────────────────────────── */
