//自建题库第162题   题号:718
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：从文件infile162.txt中连续读入10个以磅为单位
      的重量值，将其转换为以千克为单位的值并求和，
      将计算所的和sum输出到文件out162.txt中。
      说明：一磅等于0.454千克。
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/

#include <fstream.h>
#include <stdlib.h>

int main()
{

        ifstream ifile;
        fstream myfile;
        double num,sum=0;

        ifile.open ("infile162.txt",ios::in);
        myfile.open("out162.txt",ios::out);

        /**********Program**********/







        /**********  End  **********/

        myfile<<sum<<endl;

        ifile.close();
        myfile.close();
        return 0;
}
