/*
 * 来源：C++题库 题号916
 * 章节：第3章-函数
 * 难度：中
 * 题序：第210题
 *
 * 题目：该程序要求实现函数myfun，其功能为：计算数组a的每行元素的最大值，
 */

第210题 （0.1分）        题号:916        难度:中        第3章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：该程序要求实现函数myfun，其功能为：计算数组a的每行元素的最大值，
并将第i行最大值存入数组max相应的第i个元素。
说明：二维数组a是3*5的数组，数组max长度为3.
--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除"program"和
      "End"两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/
#include <iostream>
#include <fstream>
using namespace std;
void grading();

//a -- 二维数组，3*5
//max -- 一位数组，长度为3
//功能 -- 将a的每行(i)最大元素的值存入max的第i个元素
void myfun(int a[][5],int max[])
{
/**********Program**********/



/**********  End  **********/
}

int main()
{
        int a[3][5]={{13,36,4,3,5},{5,2,45,6,117},{45,3,28,23,7}};
        int max[3];
        myfun(a,max);
        for(int i=0;i<3;i++)
                cout<<max[i]<<endl;
        grading();
        return 0;
}

//以下忽略阅读
void grading()
{
        int i,j,k,max[3],a[3][5];
        ifstream rf("in.txt",ios::in);
        ofstream wf("out.txt",ios::out); 
        for(k=0;k<10;k++)
        {
                for(i=0;i<3;i++)
                        for(j=0;j<5;j++)
                                rf>>a[i][j];
                myfun(a,max);
                for(i=0;i<3;i++)
                        wf<<max[i]<<' ';
                wf<<endl;
        }
        rf.close();
        wf.close();
}



/* ───────── 参考答案 ─────────
int i,j;
	for (i=0;i<3;i++){
		max[i]=a[i][0];
		for(j=1;j<5;j++)
			if(a[i][j]>max[i])
				max[i]=a[i][j];
	}
   ─────────────────────────── */
