/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：文件in.txt中包含至少1000个整数，这些整数中每
      10个才有一个是有效数，其它都是无效数。有效数
      的序号分别为3,13,23,33,43，...1003，找出有效
      数，写入文件out.txt中。第一个数的序号为1。

      要求：找出前100个有效数，每10个一行写入out.txt
      中，整数之间使用一个空格符隔开。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除"Program"和
      "End"两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

int main()
{
/**********Program**********/



/**********  End  **********/
        return 0;
}
