/*
 * 来源：C++题库 题号266
 * 章节：第1章-C++基本语法
 * 难度：中
 * 题序：第29题
 *
 * 题目：查找水仙花数及个数 n （水仙花数是三位数，每
 */

第29题 （0.1分）        题号:266        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 查找水仙花数及个数 n （水仙花数是三位数，每
       位数字的立方和等于这个数本身，示例见图1）。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/


#include <iostream.h>
#include <fstream.h>
#include <stdio.h>

void writeinfile(int n);

void main()
{
int m,n=0,a,b,c;
/**********Program**********/



/**********  End  **********/

writeinfile(n);
}

void writeinfile(int n)
{
  fstream myfile;
  myfile.open("out.dat",ios::out);
  myfile<<n<<endl;
  myfile.close();
}



/* ───────── 参考答案 ─────────
for (m=100;m<=999;m++)
	 {
           a=m/100;
	   b=m%100/10;
	   c=m%100%10;
	   if(m==a*a*a+b*b*b+c*c*c)
	    {
              cout<<m<<"\n";n++;
            }
	  }
   ─────────────────────────── */
