/*
 * 来源：C++题库 题号268
 * 章节：第1章-C++基本语法
 * 难度：中
 * 题序：第31题
 *
 * 题目：找出1-200之间的完数个数 n（完数是一个数的因
 */

第31题 （0.1分）        题号:268        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目： 找出1-200之间的完数个数 n（完数是一个数的因
      子之和是这个数本身。例如6=1+2+3）。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
------------------------------------------------*/


#include <iostream.h>
#include <fstream.h>
#include <stdio.h>

void writeinfile(int n);

void main()
{
int m,n,k,s,l;
/**********Program**********/



/**********  End  **********/
writeinfile(n);
}


void writeinfile(int n)
{
fstream myfile;
myfile.open("f.txt",ios::out);
myfile<<n<<endl;
myfile.close();
}




/* ───────── 参考答案 ─────────
----------------------
n=0;
for(m=1;m<=200;m++)
{s=1;
for(l=2;l<m;l++)
if(m%l==0)s+=l;
if(m==s){n++;cout<<m;}
}
----------------------
   ─────────────────────────── */
