/*
 * 来源：C++题库 题号637
 * 章节：第1章-C++基本语法
 * 难度：较易
 * 题序：第103题
 *
 * 题目：求3000以内的全部亲密数
 */

第103题 （0.1分）        题号:637        难度:较易        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：求3000以内的全部亲密数。
说明：如果正整数A的全部因子(包括1，不包括A本身)之和
      等于B；且正整数B的全部因子(包括1，不包括B本身)
      之和等于A，则将正整数A和B称为亲密数。
      1不和其他数形成亲密数。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，仅在函数的花括号中填入所编
      写的若干语句。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;
int grading();

int yinziSum(int a) /*求a的因子和*/
{
        /**********Program**********/                






        /**********Program**********/                
}

int main()
{
        int a,b;
        
        for(a=1;a<3000;a++) 
        { 
                b=yinziSum(a);
                if (a==yinziSum(b)&&a<b) 
                        cout<<a<<" 和 "<<b<<" 是一对亲密数。"<<endl;
        }

//忽略阅读        
        grading();
//忽略阅读结束

        return 0;
}

//以下忽略阅读
int grading()
{
        int a,b;
        ofstream myfile;
        myfile.open("f2.txt",ios::out);
        
        for(a=1;a<3000;a++) 
        { 
                b=yinziSum(a);
                if (a==yinziSum(b)&&a<b) 
                        myfile<<a<<"和"<<b<<"是一对亲密数。"<<endl;
        }
        
        myfile.close();
        return 0;
}



/* ───────── 参考答案 ─────────
int i,b;
	b=0;
	for(i=1;i<=a/2;i++) 
		if(!(a%i)) b+=i; 
	return b;
   ─────────────────────────── */
