/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：文件in.txt中包含至少1000个整数，这些整数每10个
      一组，编写程序从该文件中读取这些整数，找出每一
      组数中的最大数，写入文件out.txt中。

      要求：总共读取100组整数，找出的100个最大数，每
      10个一行写入out.txt中，整数之间使用一个空格符
      隔开。

--------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它
      函数中的任何内容，不要修改或删除"Program"和
      "End"两行注释，仅在其中填入所编写的代码。
--------------------------------------------------*/

#include <iostream>
#include <fstream>
using namespace std;

int main()
{
/**********Program**********/




/**********  End  **********/
        return 0;
}
